## Plan Result (demo-cftapps_cluster_lb_backend)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw"
        name                = "aks00-demo-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (4 unchanged attributes hidden)


      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test1"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test2"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test3"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test4"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test5"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test6"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test7"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test8"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test9"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test10"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test11"
        }
      + backend_address_pool {
          + ip_addresses = [
              + "10.50.79.246",
              + "10.50.95.246",
            ]
          + name         = "test-test12"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test1"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test1"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test2"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test2"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test3"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test3"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test4"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test4"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test5"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test5"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test6"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test6"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test7"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test7"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test8"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test8"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test9"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test9"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test10"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test10"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test11"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test11"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + name                                = "test-test12"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_name                          = "test-test12"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }




      ~ http_listener {
          ~ host_name                      = "docmosis.demo.platform.hmcts.net" -> "test-test1-demo.service.core-compute-demo.internal"
            id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/dg-docmosis-redirect"
          ~ name                           = "dg-docmosis-redirect" -> "test-test1"
            # (7 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test2-demo.service.core-compute-demo.internal"
          + name                           = "test-test2"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test3-demo.service.core-compute-demo.internal"
          + name                           = "test-test3"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test4-demo.service.core-compute-demo.internal"
          + name                           = "test-test4"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test5-demo.service.core-compute-demo.internal"
          + name                           = "test-test5"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test6-demo.service.core-compute-demo.internal"
          + name                           = "test-test6"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test7-demo.service.core-compute-demo.internal"
          + name                           = "test-test7"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test8-demo.service.core-compute-demo.internal"
          + name                           = "test-test8"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test9-demo.service.core-compute-demo.internal"
          + name                           = "test-test9"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test10-demo.service.core-compute-demo.internal"
          + name                           = "test-test10"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test11-demo.service.core-compute-demo.internal"
          + name                           = "test-test11"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "test-test12-demo.service.core-compute-demo.internal"
          + name                           = "test-test12"
          + protocol                       = "Http"
        }
      + http_listener {
          + frontend_ip_configuration_name = "appGwPrivateFrontendIp"
          + frontend_port_name             = "http"
          + host_name                      = "docmosis.demo.platform.hmcts.net"
          + name                           = "dg-docmosis-redirect"
          + protocol                       = "Http"
        }


      + probe {
          + host                                      = "test-test1-demo.service.core-compute-demo.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "test-test1"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "test-test2-demo.service.core-compute-demo.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "test-test2"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "test-test3-demo.service.core-compute-demo.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "test-test3"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "test-test4-demo.service.core-compute-demo.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "test-test4"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "test-test5-demo.service.core-compute-demo.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "test-test5"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "test-test6-demo.service.core-compute-demo.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "test-test6"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "test-test7-demo.service.core-compute-demo.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "test-test7"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }
      + probe {
          + host                                      = "test-test8-demo.service.core-compute-demo.internal"
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "test-test8"
          + path                                      = "/health/liveness"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3

          + match {
              + body        = (known after apply)
              + status_code = (known after apply)
            }
        }

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

rceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/xui-activity-tracker-api" -> null
          - backend_http_settings_name = "xui-activity-tracker-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/xui-activity-tracker-api" -> null
          - http_listener_name         = "xui-activity-tracker-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/xui-activity-tracker-api" -> null
          - name                       = "xui-activity-tracker-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/xui-activity-tracker-api"
          + backend_address_pool_name  = "xui-activity-tracker-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/xui-activity-tracker-api"
          + backend_http_settings_name = "xui-activity-tracker-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/xui-activity-tracker-api"
          + http_listener_name         = "xui-activity-tracker-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/xui-activity-tracker-api"
          + name                       = "xui-activity-tracker-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/xui-terms-and-conditions" -> null
          - backend_address_pool_name  = "xui-terms-and-conditions" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/xui-terms-and-conditions" -> null
          - backend_http_settings_name = "xui-terms-and-conditions" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/xui-terms-and-conditions" -> null
          - http_listener_name         = "xui-terms-and-conditions" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/xui-terms-and-conditions" -> null
          - name                       = "xui-terms-and-conditions" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/xui-terms-and-conditions"
          + backend_address_pool_name  = "xui-terms-and-conditions"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/xui-terms-and-conditions"
          + backend_http_settings_name = "xui-terms-and-conditions"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/xui-terms-and-conditions"
          + http_listener_name         = "xui-terms-and-conditions"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/xui-terms-and-conditions"
          + name                       = "xui-terms-and-conditions"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/xui-terms-and-conditions-int" -> null
          - backend_address_pool_name  = "xui-terms-and-conditions-int" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/xui-terms-and-conditions-int" -> null
          - backend_http_settings_name = "xui-terms-and-conditions-int" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/xui-terms-and-conditions-int" -> null
          - http_listener_name         = "xui-terms-and-conditions-int" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/xui-terms-and-conditions-int" -> null
          - name                       = "xui-terms-and-conditions-int" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendAddressPools/xui-terms-and-conditions-int"
          + backend_address_pool_name  = "xui-terms-and-conditions-int"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/backendHttpSettingsCollection/xui-terms-and-conditions-int"
          + backend_http_settings_name = "xui-terms-and-conditions-int"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/httpListeners/xui-terms-and-conditions-int"
          + http_listener_name         = "xui-terms-and-conditions-int"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw/requestRoutingRules/xui-terms-and-conditions-int"
          + name                       = "xui-terms-and-conditions-int"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test1"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test1"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test1"
          + id                         = (known after apply)
          + name                       = "test-test1"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test10"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test10"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test10"
          + id                         = (known after apply)
          + name                       = "test-test10"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test11"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test11"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test11"
          + id                         = (known after apply)
          + name                       = "test-test11"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test12"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test12"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test12"
          + id                         = (known after apply)
          + name                       = "test-test12"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test2"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test2"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test2"
          + id                         = (known after apply)
          + name                       = "test-test2"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test3"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test3"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test3"
          + id                         = (known after apply)
          + name                       = "test-test3"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test4"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test4"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test4"
          + id                         = (known after apply)
          + name                       = "test-test4"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test5"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test5"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test5"
          + id                         = (known after apply)
          + name                       = "test-test5"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test6"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test6"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test6"
          + id                         = (known after apply)
          + name                       = "test-test6"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test7"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test7"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test7"
          + id                         = (known after apply)
          + name                       = "test-test7"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test8"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test8"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test8"
          + id                         = (known after apply)
          + name                       = "test-test8"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "test-test9"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "test-test9"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "test-test9"
          + id                         = (known after apply)
          + name                       = "test-test9"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }



        # (367 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1217,"Program":"tfcmt","SHA1":"","Target":"demo-cftapps_cluster_lb_backend","Vars":{}} -->